app/controllers/main_controller.rb

  def index
    @scores = Score.order("score")
---
SELECT "scores".* FROM "scores" WHERE (difficulty LIKE '%easy%') ORDER BY "scores"."score" ASC