app/controllers/scores_controller.rb

  def index
    @scores = Score.order(score: :asc)
---
SELECT "scores".* FROM "scores" ORDER BY "scores"."score" ASC

  def create
    @score = Score.new(params[:score])
    session[:name] = @score.name
    if @score.save
---
INSERT INTO "scores" ("name", "score", "difficulty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "名無しさん"], ["score", 50.657], ["difficulty", "impossible"], ["created_at", "2017-09-01 06:24:29.886968"], ["updated_at", "2017-09-01 06:24:29.886968"]]

  def search
    @score = Score.new
    @scores = Score.search(params[:difficulty]).order(score: :asc)
---
SELECT "scores".* FROM "scores" WHERE (difficulty LIKE '%easy%') ORDER BY "scores"."score" ASC